#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2020/8/22 20:58
# @Author  : Jack Deng
# @File    : 字符串格式化输出.py
# @Software: PyCharm

"""
1.%占位符格式化
    %s==>字符串占位
    %d==>取整占位
        扩展用法：%nd==>取整占位，并且max{填充数字取整位数,n}位显示,多余长度,左边默认空格填充
        扩展用法：%-nd==>取整占位，并且max{填充数字取整位数,n}位显示,多余长度,右边默认空格填充
        扩展用法：%0nd==>取整占位，并且max{填充数字取整位数,n}位显示,多余长度,左边默认0填充
        扩展用法：%0-nd==>取整占位，并且max{填充数字取整位数,n}位显示,多余长度,右边默认0填充
    %f==>浮点数占位
        扩展用法:%.nf==>浮点数保留小数点后n位占位
    %%==>普通%符号占位
    %x==>小写16进制整数占位
    %X==>大写16进制整数占位
2.format函数格式化

"""